app/controllers/beers_controller.rb

SELECT  "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def find_beer
		@beer = Beer.find(params[:id])