app/controllers/beers_controller.rb

	def index

		if params[:beer_tag_description]
			@tag_desc = params[:beer_tag_description]
			@tags = Tag.all.select {|tag| tag.description == params[:beer_tag_description]}
			@beers = []
			@tags.each do |tag|
				tag.beers.each do |beer|
					@beers << beer
				end
			end
			@beers
		else
			@beers = Beer.all
---
SELECT "beers".* FROM "beers"