app/controllers/breweries_controller.rb

SELECT  "breweries".* FROM "breweries" WHERE "breweries"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
	def find_brewery
		@brewery = Brewery.find(params[:id])